/*
  第一題
  以下運算何者得出的數值不同 ?
  a.a = a+1;
  b.a += 1;
  c.a++;
  d.以上結果皆相同。

  ans : d；
*/

/*
  第二題
  關於賦值運算子的敘述何者 "錯誤" ?
  a.可以使用賦值運算子簡化計算過程。
  b.賦值運算子包含 += 、 -=。
  c.賦值運算子不能拿來運算。
  d.a = a+1 跟 a += 1 是相同的意思。

  ans : c； 可以。
*/

/*
  第三題
  關於 a++、a-- 的敘述何者 "錯誤" ?
  a.a++、a-- 沒有寫 = ，所以沒有賦予值到變數。
  b.a++ 可以幫 a 變數累加 1。
  c.a++ 可以連續使用。
  d.a-- 可以幫 a 變數減 1。

  ans : a; 有賦予值到變數。
*/

/*
  第四題
  請問以下變數 a、b 的數值各為多少 ?
  let a = 0;
  let b = 0;
  a += 1;
  b--;
  b += 2;
  a--;
  a.a 為 2 、 b 為 1。
  b.a 為 0 、 b 為 1。
  c.a 為 3 、 b 為 2。
  d.a 為 1 、 b 為 2。

  ans : b; 
*/

/*
  第五題
  請問以下變數 a、b 的數值各為多少 ?
  let a = 0;
  let b = 0;
  a = a + 1;
  a += 2;
  b = a + 1;
  a--;
  a.a 為 2 、 b 為 1。
  b.a 為 2 、 b 為 4。
  c.a 為 3 、 b 為 2。
  d.a 為 4 、 b 為 2。

  ans : b;
*/