/*
  第一題
  請問 html 中哪個連結是用來引入 JavaScript 檔案 ?
  a.選項一。
  b.選項二。
  c.選項三。
  d.選項四。

  ans : d； (a 設置 IE 版本兼容模式 、 b 設置 RWD 響應式設備有關 、 c 引入 CSS 檔案)。
*/

/*
  第二題
  以下敘述何者為 "錯" ?
  a.console.log() 可以印出變數。
  b.alert() 彈跳式視窗可以顯示變數。
  c.VScode 不能寫 JavaScript。
  d.chrome 開發人員工具可以寫 JavaScript。

  ans : c； 可以。
*/

/*
  第三題
  以下關於註解的描述何者為 "錯" ?
  a.可以使用 // 來寫單行註解。
  b.被 // 單行註解的內容不會被執行。
  c.寫單行註解時不用使用 // ，直接打字也不會出問題。
  d.新增註解可以使其他人更容易理解程式碼。

  ans : c; 要使用 // 。
*/

/*
  第四題
  關於 CodePen 的敘述，何者為 "錯" ?
  a.可以使用 Fork 複製別人的程式碼。
  b.無法直接修改別人的程式碼。
  c.CodePen 不能編輯 HTML、CSS。
  d.可以使用 CodePen 連結提交作業。

  ans : c; 可以編輯。 
*/

/*
  第五題
  關於 CodePen 的敘述，何者為 "錯" ?
  a.提交兩份作業時要確保網址不同。
  b.相同網址也可以提交兩份不同作業。
  c.可以不用額外載入 JavaScript 檔案。
  d.能在同一個頁面編輯。
  
  ans : b 不行，會發生後蓋前的壯況。
*/