/*
  第一題
  以下關於 let、const、var 變數的介紹何者為 "錯" ?
  a.let 不可以重複宣告。
  b.const 不可以重複宣告。
  c.var 會汙染全域變數，容易造成不可預期的錯誤。
  d.let 宣告的變數不可以被重新賦予值。

  ans : d； 可以重新賦予值。
*/

/*
  第二題
  以下關於 let、const 變數的比較何者為 "錯" ?
  a.let 可以拿來宣告會被重新賦予值的變數。
  b.用 const 宣告時該值如果為基本型別則難以被覆寫。
  c.const 可以用來宣告易更改值的變數。
  d.可以透過 const 宣告常數。

  ans : c； const 不能更改值。
*/

/*
  第三題
  以下題目僅一題不會報錯，請選出哪題 "不會報錯" ?
  a.let a = 1; a = 2;
  b.let b = 1; let b = 2;
  c.const let = 1;
  d.const c = 1; c = 2;

  ans : a; (b 不能重複宣告 、 c 不能用保留字當變數  d 不能更改值)。
*/

/*
  第四題
  在使用 const 宣告變數時，遇到以下情況，何者 "不會報錯" ?
  a.使用 const 宣告保留字。
  b.變數使用數字命名。
  c.使用小駝峰式命名。
  d.重複宣告。

  ans : c; (a 不能用保留字當變數 、 b 不能使用數字開頭命名 、 d 不能重複宣告)。
*/

/*
  第五題
  請選出何者為 "好的" 變數命名習慣 ?
  a.語意化。
  b.使用自己發明的縮寫。
  c.使用數字命名。
  d.混合各種命名方式 ： 例如部分使用小駝峰式命名、部分使用大駝峰式命名。

  ans : a。
*/