/*
  第一題
  小明想畫一個腰圍判斷流程圖，他知道男生腰圍超過 90 為過胖，女生腰圍超過 80 為過胖，
  目前流程圖畫了一半，請幫他畫黃色區塊該填什麼 ? (圖片一)
  a.體型正常。
  b.體型過胖。
  c.腰圍是否超過 80。
  d.計算結束。

  ans : c;
*/

/*
  第二題
  小明畫了腰圍判斷流程圖如下，但他少了一個很重要的步驟，請問是哪個步驟 ? (圖片二)
  a.所有的流程都要連到計算結束。
  b.決策判斷步驟不是菱形要改成長方形。
  c.計算開始、計算結束步驟可以省略。
  d.體型過胖、體型正常步驟的符號應該從長方形改成菱形。

  ans : a；
*/

/*
  第三題
  小明畫完流程圖要開始撰寫 Code 了，他想先寫出是否為男生的判斷式，他先命名了一個 sex 變數，
  代表性別，並設定 "male" 值代表男性，請問以下判斷式哪個寫法 "正確" ? (圖片三)
  a.if (sex == "male"){console.log("男生");} else {console.log("女生");}
  b.else(sex == "male"){console.log("男生");} else {console.log("女生");}
  c.if (sex == "male"){console.log("男生");} if {console.log("女生");}
  d.if (sex != "male"){console.log("男生");} else {console.log("女生");}

  ans : a;
*/

/*
  第四題
  小明想挑戰畫出流程圖判斷是否為偶數，請問他畫的流程圖是哪個步驟 "錯誤" ? (圖片四)
  a.符號使用錯誤。
  b.流程圖不需要使用到決策判斷的菱形符號。
  c.應該由是偶數、不是偶數步驟連結到計算結束，而不是由決策判斷符號直接連到計算結束。
  d.是偶數、不是偶數步驟的長方形符號應該改成菱形符號。
  
  ans : c;
*/

/*
  第五題
  小明畫完了判斷是否為偶數的流程圖，他想先判斷 8 是否為偶數，請問他該如何撰寫程式呢 ? (圖片五)
  a.if(8 + 2 === 0){alert('偶數')} else {alert('奇數')}
  b.if(8 - 2 === 0){alert('偶數')} else {alert('奇數')}
  c.if(8 * 2 === 0){alert('偶數')} else {alert('奇數')}
  d.if(8 % 2 === 0){alert('偶數')} else {alert('奇數')}

  ans : d;
*/