/*
  第一題
  關於流程圖的介紹何者 "錯誤" ?
  a.可以培養運算思維。
  b.可以使用 VSCode 畫流程圖。
  c.可以使用 whimsical 或 PowerPoint 畫流程圖。
  d.流程圖可以練習任務拆解。

  ans : b; 不能。
*/

/*
  第二題
  關於流程圖的符號何者 "錯誤" ?
  a.箭頭代表流程符號。
  b.圓角長方形代表起止符號。
  c.菱形代表決策判斷。
  d.長方形代表的起始符號。

  ans : d； 代表程式符號。
*/

/*
  第三題
  關於流程圖的敘述何者 "錯誤" ?
  a.圓角長方形的起止符號只能用於開頭，結尾不能用。
  b.菱形的決策判斷符號通常以是 / 否來決定。
  c.可以使用箭頭來連接每個流程。
  d.長方形代表程式符號。

  ans : a; 開頭、結尾都能用。
*/

/*
  第四題
  小明畫了想查詢自己錢包有多少錢的流程圖，請問他哪邊畫錯了呢 ? (參考圖片一)
  a.流程規劃的不妥當。
  b.設定錢包初始狀態、填入裡頭金額步驟應該使用長方形的程式符號。
  c.連結流程圖的地方不應該使用箭頭符號。
  d.計算開始、計算結束的步驟應該使用菱形的決策判斷。
  
  ans : b;
*/

/*
  第五題
  小明想判斷自己錢包裡面有多少錢，如果超過 120 元就去吃鐵板麵，
  他規劃了流程圖後發現自己錢包有 200 元，所以他跑去吃鐵板麵，
  請問流程圖中的黃色區塊，還會執行嗎 ? (參考圖片二)
  a.會執行。
  b.不會執行。
  c.我也不知道會不會執行。
  d.一定不是這個選項。

  ans : b;
*/